Repository: Kun686/iTerm2-CN
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Send Text with “vim” Special Chars
zh_hans: 发送带“vim”特殊字符的文本

source: Send Text without Broadcasting
zh_hans: 发送文本但不广播

# ui.settings.itermeditkeyactionwindowcontroller.send_tmux_command.e1023a0c
source: Send tmux Command
zh_hans: 发送 tmux 命令

# ui.settings.itermeditkeyactionwindowcontroller.sequence.5181d985
source: Sequence…
zh_hans: 序列…

# ui.settings.itermeditkeyactionwindowcontroller.split.32afaa78
source: Split
zh_hans: 分割

source: Split Horizontally with Profile
zh_hans: 使用配置文件水平分割

# ui.settings.itermeditkeyactionwindowcontroller.split_panes.aaa052df
source: Split Panes
zh_hans: 分割窗格

source: Split Vertically with Profile
zh_hans: 使用配置文件垂直分割

# ui.settings.itermeditkeyactionwindowcontroller.swap_with_next_pane.e447408a
source: Swap With Next Pane
zh_hans: 与下一个窗格交换

# ui.settings.itermeditkeyactionwindowcontroller.swap_with_previous_pane.66e117f4
source: Swap With Previous Pane
zh_hans: 与上一个窗格交换

# ui.settings.itermeditkeyactionwindowcontroller.toggle_setting.31b25d9a
source: Toggle Setting
zh_hans: 切换设置

# ui.settings.itermeditkeyactionwindowcontroller.toggles.420d9aec
source: Toggles
zh_hans: 开关

source: Press any key to dismiss this message.
zh_hans: 按任意键关闭此消息。

# ui.settings.eventmonitorview.click_or_tap_here_to_set_input_fields.433cf1a1
source: Click or Tap Here to Set Input Fields
zh_hans: 点按或轻点此处设置输入字段

# ui.settings.itermcursorblinkfadepreset.breathing.762c550a
source: Breathing
zh_hans: 呼吸

# ui.settings.itermcursorblinkfadepreset.linear.e6950b45
source: Linear
zh_hans: 线性

# ui.settings.itermcursorblinkfadepreset.fast.6c582b62
source: Fast
zh_hans: 快速

# ui.settings.itermcursorblinkfadepreset.slow.4b2bebbf
source: Slow
zh_hans: 慢速

# ui.settings.itermcursorblinkfadepreset.subtle.3eadecfb
source: Subtle
zh_hans: 轻柔

# ui.api.itermapiscriptlauncher.unknown_error.3e4443e5
source: unknown error
zh_hans: 未知错误

# ui.api.itermapiscriptlauncher.intel_only_python_environment_unavailable.b7ae1806
source: “%@” uses an Intel-only Python environment, which cannot run on this version of macOS because Rosetta is not available.
zh_hans: “%@”使用仅支持 Intel 的 Python 环境。由于 Rosetta 不可用，该环境无法在此版本的 macOS 上运行。

# ui.language.itermparsedexpression.unknown_error.27c2ccd9
source: Unknown error
zh_hans: 未知错误

# ui.staterestoration.itermgraphdatabase.unknown_error.27c2ccd9
source: Unknown error
zh_hans: 未知错误

# ui.logging.debuglogging.could_not_open_for_writing.ad05c96b
source: could not open %@ for writing
zh_hans: 无法打开 %@ 进行写入

# ui.processinfo.itermjobtreeviewcontroller.one_process_and_its_children.f5d6e962
source: one process and its children
zh_hans: 一个进程及其子进程

# ui.processinfo.itermjobtreeviewcontroller.processes_and_their_children.ba114a10
source: %@ processes and their children
zh_hans: %@ 个进程及其子进程

# ui.processinfo.itermjobtreeviewcontroller.one_process.09d93897
source: one process
zh_hans: 一个进程

# ui.processinfo.itermjobtreeviewcontroller.processes.c53402d8
source: %@ processes
zh_hans: %@ 个进程

# ui.settings.preferencepanel.empty_default.3fc161f2
source: Empty Default
zh_hans: 空默认值

# ui.api.itermapiscriptlauncher.apple_silicon_runtime_download_failed.e4c30da1
source: The Apple Silicon runtime could not be downloaded. Check your network connection and try again.
zh_hans: 无法下载 Apple 芯片版运行时。请检查网络连接后重试。

# ui.api.itermapiscriptlauncher.setup_cfg_could_not_be_read.037b527a
source: Its setup.cfg could not be read, so it cannot be rebuilt automatically.
zh_hans: 无法读取其 setup.cfg，因此无法自动重新构建。

# ui.api.itermapiscriptlauncher.migrating_script_to_new_python_runtime.88bf244a
source: Migrating this script to the new Python runtime…
zh_hans: 正在将此脚本迁移到新的 Python 运行时…

source: Its environment is intact; turn off the uv advanced setting to rebuild it for Apple Silicon.
zh_hans: 其环境完好；请关闭 uv 高级设置，以便针对 Apple 芯片重新构建。

source: Setting up the Python environment…
zh_hans: 正在设置 Python 环境…

# ui.api.itermscriptsmenucontroller.upgrading_script.ca9cc18c
source: Upgrading “%@”…
zh_hans: 正在升级“%@”…

# ui.api.itermscriptsmenucontroller.setting_up_python_environment.32371e53
source: Setting up the Python environment…
zh_hans: 正在设置 Python 环境…

# ui.api.itermscriptexporter.invalid_location_not_under_scripts.52128789
source: Invalid location (not under Scripts folder).
zh_hans: 位置无效（不在 Scripts 文件夹中）。

# ui.api.itermscriptexporter.script_not_found_at_selected_location.184a93fc
source: No found script at selected location.
zh_hans: 所选位置未找到脚本。

# ui.api.itermscriptexporter.could_not_parse_install_requires.f401649c
source: Could not parse install_requires in setup.cfg
zh_hans: 无法解析 setup.cfg 中的 install_requires

# ui.api.itermscriptexporter.failed_to_create_zip_file.3da3440f
source: Failed to create zip file.
zh_hans: 创建 ZIP 文件失败。
